In [1]:
import pandas as pd
import numpy as np
pd.options.display.max_rows = 999

In [2]:
df = pd.read_csv('/Users/allen/Downloads/try numbers of months.csv')
df.drop(columns=['Unnamed: 0'], inplace=True)
df['outbound'] = np.where(df['outbound'] < 0, 0, df['outbound'])
df.dropna(inplace=True)
df = df.sort_values(['CNOC','Year_Month']).reset_index(drop=True)

In [3]:
df.head()

  Year_Month       CNOC  outbound
0    2019-05  001604797  11293.95
1    2018-06  00160819X   9074.95
2    2018-07  00160819X    850.04
3    2018-08  00160819X   3808.59
4    2018-09  00160819X   6663.10

In [4]:
def num_of_zero(x):
    # no 0 or all 0
    if not any(x == 0) or all(x == 0):
        count = 0
    
    # set doesn't start with 0
    elif x[0] != 0:
        count = sum(x == 0)
    
    # set starts with 0
    else:
        non_zero_index = [i for i, value in enumerate(x != 0) if value]
        first_non_zero_index = non_zero_index[0]
        x_new = x[first_non_zero_index:]
        count = sum(x_new == 0)
    
    return count

In [5]:
lookup = df.groupby('CNOC').agg(
    zero_counts = ('outbound', num_of_zero)
).sort_values('zero_counts', ascending=False).reset_index(drop=False)

In [6]:
lookup.head(10)

        CNOC  zero_counts
0  731431234          8.0
1  558976475          7.0
2  231923486          7.0
3  689600566          7.0
4  058635017          7.0
5  679086962          6.0
6  MA089NU66          6.0
7  582319643          6.0
8  723520894          6.0
9  565259351          6.0